{
  "header": {
    "title": "Tech Lead | Software Engineer | Senior Consultant",
    "location": "Rome, Italy"
  },
  "summary": "Software Engineer with 10 years of experience in Web and Mobile development, specializing in scalable architecture design. Served as Tech Lead on complex projects, managing teams of 10+ developers and designing innovative solutions, including a next-generation micro-frontend architecture. Led multiple Proof of Concepts for cross-platform applications with user interfaces orchestrated by AI agents. Actively leverage advanced AI tools (e.g., Google Antigravity, Claude, ChatGPT) to accelerate development, optimize processes, and improve software quality. Continuously updated on modern frameworks, libraries, and methodologies, maintaining a strong focus on innovation and continuous improvement.",
  "experience": {
    "open_reply": {
      "location": "Rome, Italy",
      "role": "Tech Lead | Senior Consultant | Front-end Expert | Software Engineer",
      "description": "I worked with several clients:",
      "projects": {
        "open_reply": {
          "description": "I worked as Tech Lead on several PoCs for Open Reply, contributing to the design and development of innovative cross-platform applications. These applications stand out because the entire user interface is controlled by AI agents."
        },
        "photosi": {
          "description": "I worked on the PhotoSì project, contributing to the development of the client’s photo book editor for both mobile and web applications."
        },
        "churchs": {
          "description": "I worked on the Church’s project, contributing to the enhancement of the website’s user experience."
        },
        "mediaset": {
          "description": "I worked on the Mediaset project, contributing to the development of a new Smart TV application that enables users to access movies, TV series, and live channels offered by Mediaset."
        },
        "unipol": {
          "description": "I worked on the UnipolSai project as Tech Lead and Frontend Expert, leading the design and development of a new micro-frontend architecture based on Module Federation and managing a dynamic team of over 10 developers."
        },
        "bat": {
          "description": "I worked on the Vuse.com project, contributing to the development of a web application for managing and using the MyVuse electronic cigarette, as well as creating an interactive browser based on BLE technology."
        },
        "prada": {
          "description": "I worked on the e-commerce projects of Prada, Miu Miu and Car Shoe."
        }
      }
    },
    "accenture": {
      "location": "Rome, Italy",
      "role": "Application Development Senior Analyst | Frontend Expert | Software Engineer",
      "description": "I worked with several clients:",
      "projects": {
        "skoda": {
          "description": "I worked on Škoda’s e-commerce platform, contributing to the development of a cutting-edge web solution. My role involved designing an engaging and user-friendly interface to enhance the overall user experience."
        },
        "leonardo": {
          "description": "I worked on the Euronaval project, contributing to the development of the web platform and designing an engaging, user-friendly interface to enhance the overall user experience."
        },
        "egeos": {
          "description": "I worked on the e-GEOS project, contributing to the design, construction, and development of CLEOS, a cutting-edge web platform."
        },
        "msc": {
          "description": "I worked on the MSC Crociere website, contributing to the development and optimization of the web platform."
        }
      }
    },
    "social_academy": {
      "location": "Rome, Italy",
      "role": "Full-Stack developer | Business in Cloud's software architect | Software Engineer",
      "description": "I designed, developed, and tested the software components of Social Academy’s platforms, including Marketplace (e-commerce for training courses), Skill Games (online quizzes to discover vocation and potential skills), MySA (access to course lessons and videos), Dashboard (management of academies, courses, leads, and email campaigns), and BusinessInCloud (marketing platform for creating funnels and landing pages). I also integrated numerous external services, such as Paypal, Stripe, Thrivecart, ClickFunnels, Mailchimp, Mailmunch, ActiveCampaign, Facebook, Calendly, Typeform, and Zapier."
    },
    "nyu": {
      "location": "New York, USA",
      "role": "Internship | Software Developer",
      "logoText": "New York University",
      "description": "I worked on the Terraling project, a collection of searchable linguistic databases that enables users to explore the morphological, syntactic, and semantic properties of languages and understand how these properties compare across different languages."
    },
    "the_city": {
      "location": "Rome, Italy",
      "role": "Full-Stack developer",
      "description": "I worked for a real estate agency, developing its online marketplace."
    },
    "innovaction_lab": {
      "location": "Rome, Italy",
      "role": "CTO | Full-Stack developer",
      "description": "InnovAction Lab is a training program designed to transform innovative ideas into startups. My team and I created a startup called “Fashape”, aimed at helping users discover the best men’s fashion products through a daily wish list featuring the most voted items from social networks."
    },
    "hsc": {
      "location": "Rome, Italy",
      "role": "Software Developer",
      "description": "I collaborated on the development of the company’s enterprise software."
    },
    "istc": {
      "location": "Rome, Italy",
      "role": "Internship | Software Developer",
      "description": "I developed a desktop application for a robotic platform designed to analyze a person’s posture and balance through three simple motor exercises."
    }
  },
  "education": {
    "state_exam": {
      "degree": "Government exam and licensed as a profession engineer",
      "institution": "Roma Tre University - Rome, Italy"
    },
    "master": {
      "degree": "Master's Degree in Software Engineering",
      "institution": "Roma Tre University - Rome, Italy"
    },
    "bachelor": {
      "degree": "Bachelor's Degree in Software Engineering",
      "institution": "Roma Tre University - Rome, Italy"
    }
  },
  "skills": {
    "industry": {
      "category": "Industry Knowledge",
      "items": [
        "Web, Mobile & Software Development",
        "Agile Methodologies",
        "SCRUM",
        "Object-Oriented Programming (OOP)",
        "Algorithms",
        "SQL",
        "Microfront-end Architectures",
        "TDD",
        "CI/CD"
      ]
    },
    "mobile": {
      "category": "Mobile Development"
    },
    "frontend": {
      "category": "Web Development - Front-End"
    },
    "backend": {
      "category": "Web Development - Back-End"
    },
    "database": {
      "category": "Databases"
    },
    "languages": {
      "category": "Programming Languages"
    },
    "soft": {
      "category": "Soft Skills",
      "items": [
        "Problem Solving",
        "Critical Thinking",
        "Time Management",
        "Teamwork",
        "Self Learning",
        "Analytical reasoning",
        "Adaptability"
      ]
    },
    "tools": {
      "category": "Development Tools"
    }
  },
  "languages": {
    "italian": {
      "name": "Italian",
      "level": "Native"
    },
    "english": {
      "name": "English",
      "level": "Upper Intermediate (B2 level)"
    }
  },
  "footerNote": "I authorize the processing of my personal data contained in my curriculum vitae based on art. 13 of Legislative Decree 196/2003 and art. 13 GDPR 679/16.",
  "labels": {
    "experience": "EXPERIENCE",
    "education": "EDUCATION",
    "skills": "SKILLS",
    "languages": "LANGUAGES",
    "certifications": "CERTIFICATIONS"
  },
  "dates": {
    "present": "Present",
    "year": "year",
    "years": "years",
    "month": "month",
    "months": "months"
  }
}
