{
  "header": {
    "title": "Tech Lead | Software Engineer | Senior Consultant",
    "location": "Rome, Italy"
  },
  "summary": "Software Engineer with 10 years of experience in Web and Mobile development, specializing in scalable architecture design. Served as Tech Lead on complex projects, managing teams of 10+ developers and designing innovative solutions, including a next-generation micro-frontend architecture. Led multiple Proof of Concepts for cross-platform applications with user interfaces orchestrated by AI agents. Actively leverage advanced AI tools (e.g., Google Antigravity, Claude, ChatGPT) to accelerate development, optimize processes, and improve software quality. Continuously updated on modern frameworks, libraries, and methodologies, maintaining a strong focus on innovation and continuous improvement.",
  "experience": {
    "open_reply": {
      "location": "Rome, Italy",
      "role": "Tech Lead | Senior Consultant | Front-end Expert | Software Engineer",
      "description": "I worked with several clients:",
      "projects": {
        "open_reply": {
          "description": "Served as Tech Lead on multiple proof-of-concept initiatives at Open Reply, leading the design and development of innovative cross-platform applications with AI agents orchestrating dynamic user interfaces"
        },
        "photosi": {
          "description": "Contributed to the design and development of a feature-rich photo book editor for mobile and web, supporting complex layout and customization workflows."
        },
        "churchs": {
          "description": "Contributed to enhancing Church's website user experience by implementing targeted features and optimizing usability, boosting user engagement and accessibility."
        },
        "mediaset": {
          "description": "Contributed to the development of a new Smart TV application that enables users to access movies, TV series, and live channels offered by Mediaset."
        },
        "unipol": {
          "description": "Architected and delivered a modern micro-frontend platform based on Module Federation, providing technical leadership to a cross-functional team of 10+ developers."
        },
        "bat": {
          "description": "Contributed to the development of a web application for managing MyVuse electronic cigarettes and created an interactive browser leveraging BLE technology."
        },
        "prada": {
          "description": "Contributed to building and optimizing e-commerce solutions for luxury brands Prada, Miu Miu, and Car Shoe, improving user experience and platform performance."
        }
      }
    },
    "accenture": {
      "location": "Rome, Italy",
      "role": "Application Development Senior Analyst | Frontend Expert | Software Engineer",
      "description": "I worked with several clients:",
      "projects": {
        "skoda": {
          "description": "Contributed to Škoda’s e-commerce platform by developing a micro-frontend web solution and designing an intuitive, engaging interface to enhance the overall user experience."
        },
        "leonardo": {
          "description": "Contributed to the development of Euronaval’s showcase website, designing an engaging and user-friendly interface to enhance overall user experience."
        },
        "egeos": {
          "description": "Contributed to the front-end development of CLEOS, a multi-cloud web platform transforming e-GEOS’ geoinformation services. Built user-facing components for the digital marketplace and developer portal, leveraging modern web technologies to enhance usability and engagement"
        },
        "msc": {
          "description": "Contributed to building and optimizing MSC’s e-commerce marketplace web platform, delivering a seamless, high-performance user experience."
        }
      }
    },
    "social_academy": {
      "location": "Rome, Italy",
      "role": "Full-Stack developer | Business in Cloud's software architect | Software Engineer",
      "description": "Contributed to the design, development, and testing of Social Academy’s multi-platform ecosystem (Marketplace, Skill Games, MySA, Dashboard, BusinessInCloud), integrating numerous external tools (PayPal, Stripe, Mailchimp, Calendly, Typeform, Zapier) to deliver seamless e-learning and marketing experiences."
    },
    "nyu": {
      "location": "New York, USA",
      "role": "Internship | Software Developer",
      "logoText": "New York University",
      "description": "Contributed to the development of Terraling, a collection of searchable linguistic databases enabling users to explore and compare the morphological, syntactic, and semantic properties of multiple languages."
    },
    "the_city": {
      "location": "Rome, Italy",
      "role": "Full-Stack developer",
      "description": "Contributed to the design and development of a real estate agency’s online marketplace, delivering a seamless and user-friendly experience for clients and agents."
    },
    "innovaction_lab": {
      "location": "Rome, Italy",
      "role": "CTO | Full-Stack developer",
      "description": "Participated in InnovAction Lab, a startup accelerator program, and co-created Fashape, a platform helping users discover top men’s fashion products through a daily wish list curated from social network trends."
    },
    "hsc": {
      "location": "Rome, Italy",
      "role": "Software Developer",
      "description": "Supported the development and maintenance of HSC’s enterprise software, handling database migrations and resolving issues to enhance operational efficiency."
    },
    "istc": {
      "location": "Rome, Italy",
      "role": "Internship | Software Developer",
      "description": "Engineered a desktop application for a robotic platform to evaluate and enhance users’ posture and balance, leveraging automated analysis across three motor exercises."
    }
  },
  "education": {
    "state_exam": {
      "degree": "Government exam and licensed as a profession engineer",
      "institution": "Università di Roma Tre - Rome, Italy"
    },
    "master": {
      "degree": "Master's Degree in Software Engineering",
      "institution": "Università di Roma Tre - Rome, Italy"
    },
    "bachelor": {
      "degree": "Bachelor's Degree in Software Engineering",
      "institution": "Università di Roma Tre - Rome, Italy"
    }
  },
  "skills": {
    "industry": {
      "category": "Industry Knowledge",
      "items": [
        "Web, Mobile & Software Development",
        "Agile Methodologies",
        "SCRUM",
        "Object-Oriented Programming (OOP)",
        "Algorithms",
        "SQL",
        "Microfront-end Architectures",
        "TDD",
        "CI/CD"
      ]
    },
    "mobile": {
      "category": "Mobile Development"
    },
    "frontend": {
      "category": "Web Development - Front-End"
    },
    "backend": {
      "category": "Web Development - Back-End"
    },
    "database": {
      "category": "Databases"
    },
    "languages": {
      "category": "Programming Languages"
    },
    "soft": {
      "category": "Soft Skills",
      "items": [
        "Problem Solving",
        "Critical Thinking",
        "Time Management",
        "Teamwork",
        "Self Learning",
        "Analytical reasoning",
        "Adaptability"
      ]
    },
    "tools": {
      "category": "Development Tools"
    }
  },
  "languages": {
    "italian": {
      "name": "Italian",
      "level": "Native"
    },
    "english": {
      "name": "English",
      "level": "Upper Intermediate (B2 level)"
    }
  },
  "footerNote": "I authorize the processing of my personal data contained in my curriculum vitae based on art. 13 of Legislative Decree 196/2003 and art. 13 GDPR 679/16.",
  "labels": {
    "experience": "EXPERIENCE",
    "education": "EDUCATION",
    "skills": "SKILLS",
    "languages": "LANGUAGES",
    "certifications": "CERTIFICATIONS"
  },
  "dates": {
    "present": "Present",
    "year": "year",
    "years": "years",
    "month": "month",
    "months": "months"
  }
}
