{
  "header": {
    "title": "Ingegnere Informatico | Tech Lead | Senior Consultant",
    "subTitle": "Sviluppatore Front-End & Mobile",
    "location": "Roma, Italia"
  },
  "summary": "Ingegnere Informatico con 10 anni di esperienza nello sviluppo Web e Mobile e una solida specializzazione nella progettazione di architetture scalabili. Ho ricoperto il ruolo di Tech Lead in progetti complessi, guidando team di oltre 10 sviluppatori e progettando soluzioni innovative, tra cui un’architettura micro-frontend di nuova generazione. Ho coordinato diversi Proof of Concept per applicazioni cross-platform basate su interfacce utente orchestrate da agenti di intelligenza artificiale. Integro attivamente tecnologie avanzate di AI (es. Google Antigravity, Claude, ChatGPT) nei processi di sviluppo per aumentare produttività, qualità del software e time-to-market. Costantemente aggiornato su framework, librerie e metodologie moderne, mantengo un approccio orientato all'innovazione e al miglioramento continuo.",
  "experience": {
    "open_reply": {
      "location": "Via Cavour 59, 00184, Roma, Italia",
      "role": "Tech Lead | Senior Consultant | Esperto Front-end | Ingegnere Informatico",
      "description": "Ho lavorato con diversi clienti:",
      "projects": {
        "open_reply": {
          "description": "Ho guidato diversi PoC dedicati alla progettazione e allo sviluppo di applicazioni cross-platform innovative. Questi progetti si caratterizzano per un’interfaccia utente interamente orchestrata da agenti di intelligenza artificiale."
        },
        "photosi": {
          "description": "Ho lavorato al progetto PhotoSì contribuendo allo sviluppo dell’editor di fotolibri, supportando il cliente sia nelle applicazioni mobile sia nella versione web."
        },
        "churchs": {
          "description": "Ho lavorato al progetto Church's contribuendo al miglioramento dell'esperienza utente del sito web di Church's."
        },
        "mediaset": {
          "description": "Ho lavorato al progetto Mediaset contribuendo allo sviluppo di una nuova applicazione Smart TV che permette agli utenti di accedere a film, serie TV e canali live offerti dall’emittente."
        },
        "unipol": {
          "description": "Ho lavorato al progetto UnipolSai, guidando la progettazione e lo sviluppo di una nuova architettura micro-frontend basata su Module Federation. Ho coordinato un team dinamico composto da oltre dieci sviluppatori."
        },
        "bat": {
          "description": "Ho lavorato al progetto Vuse.com, contribuendo allo sviluppo di un’applicazione web per la configurazione e l’utilizzo della sigaretta elettronica MyVuse, oltre alla realizzazione di un browser interattivo basato su tecnologia BLE."
        },
        "prada": {
          "description": "Ho lavorato sui progetti e-commerce di Prada, Miu Miu e Car Shoe."
        }
      }
    },
    "accenture": {
      "location": "Via Sciangai 53, 00144, Rome, Italy",
      "role": "Application Development Senior Analyst | Frontend Expert | Ingegnere Informatico",
      "description": "Ho lavorato con diversi clienti:",
      "projects": {
        "skoda": {
          "description": "Ho lavorato all’e-commerce di Škoda, contribuendo allo sviluppo di una piattaforma web all’avanguardia. Il mio ruolo includeva la progettazione di un’interfaccia intuitiva e coinvolgente, volta a migliorare l’esperienza utente complessiva."
        },
        "leonardo": {
          "description": "Ho lavorato al progetto Euronaval, contribuendo allo sviluppo della piattaforma web e progettando un’interfaccia intuitiva e coinvolgente per ottimizzare l’esperienza utente complessiva."
        },
        "egeos": {
          "description": "Ho lavorato al progetto e-GEO, contribuendo alla progettazione e allo sviluppo di CLEOS, una piattaforma web all’avanguardia."
        },
        "msc": {
          "description": "Ho lavorato al sito web di MSC Crociere, contribuendo allo sviluppo e all’ottimizzazione della piattaforma web."
        }
      }
    },
    "social_academy": {
      "location": "Via Catone 3, 00192, Roma, Italia",
      "role": "Sviluppatore Full-Stack | Architetto Software di Business in Cloud | Ingegnere Informatico",
      "description": "Ho progettato, sviluppato e testato i componenti software delle piattaforme di Social Academy, tra cui Marketplace (e-commerce per corsi di formazione), Skill Games (quiz online per scoprire vocazione e competenze), MySA (accesso a lezioni e video dei corsi), Dashboard (gestione di accademie, corsi, lead e campagne email) e BusinessInCloud (creazione di funnel e landing page). Ho integrato numerosi servizi esterni, tra cui Paypal, Stripe, Thrivecart, ClickFunnels, Mailchimp, Mailmunch, ActiveCampaign, Facebook, Calendly, Typeform e Zapier.",
      "techStack": [
        "HTML 5",
        "CSS 3",
        "Ruby on Rails",
        "ReactJs",
        "AngularJs",
        "Javascript",
        "JQuery",
        "AWS",
        "Heroku"
      ]
    },
    "nyu": {
      "location": "New York, NY, USA",
      "role": "Tirocinio",
      "logoText": "Università di New York",
      "description": "Ho lavorato al progetto Terraling, una collezione di database linguistici che consente agli utenti di esplorare le proprietà morfologiche, sintattiche e semantiche delle lingue e di confrontare le differenze tra di esse.",
      "techStack": [
        "Ruby on Rails",
        "GraphQl",
        "ReactJs",
        "Javascript",
        "TypeScript",
        "Bootstrap"
      ]
    },
    "the_city": {
      "location": "Via In Arcione 98, 00187, Roma, Italia",
      "role": "Sviluppatore Full-Stack",
      "description": "Ho lavorato per un’agenzia immobiliare, dove mi sono occupato della progettazione, dello sviluppo e della messa online del loro marketplace dedicato agli immobili.",
      "techStack": [
        "HTML 5",
        "CSS 3",
        "Ruby on Rails",
        "ReactJs",
        "Javascript",
        "TypeScript",
        "Bootstrap"
      ]
    },
    "innovaction_lab": {
      "location": "Via In Arcione 98, 00187, Roma, Italia",
      "role": "CTO | Sviluppatore Full-Stack",
      "description": "InnovAction Lab è un corso di formazione che ti da l’abilità di trasformare la tua idea innovativa in una startup. Io ed il mio team abbiamo creato “Fashape” per aiutare le persone a trovare i migliori prodotti maschili sul mercato attraverso una lista degli oggetti più richiesti dai social networks.",
      "techStack": [
        "MeteorJS",
        "Microsoft Azure",
        "Javascript",
        "TypeScript",
        "Bootstrap"
      ]
    },
    "hsc": {
      "location": "Via Elio Lampridio Cerva 103, 00143, Roma, Italia",
      "role": "Sviluppatore Software",
      "description": "Ho collaborato allo sviluppo, all’ottimizzazione e alla manutenzione del software aziendale",
      "techStack": ["Delphi", "PL/SQL", "Oracle"]
    },
    "istc": {
      "location": "Via S. Martino della Battaglia 44, 00185, Roma, Italia",
      "role": "Tirocinio",
      "description": "Ho sviluppato un’applicazione desktop per una piattaforma robotica, progettata per analizzare la postura di una persona attraverso tre semplici esercizi motori.",
      "techStack": ["C#", "Kinect"]
    }
  },
  "education": {
    "state_exam": {
      "degree": "Esame di Stato con abilitazione alla professione di Ingegnere dell'Informazione Specialista (187/240)",
      "institution": "Università Roma Tre - Via Ostiense 159, 00154, Roma, Italia"
    },
    "master": {
      "degree": "Laurea Magistrale in Ingegneria Informatica (103/110)",
      "institution": "Università Roma Tre - Via Ostiense 159, 00154, Roma, Italia"
    },
    "bachelor": {
      "degree": "Laurea Triennale in Ingegneria Informatica (104/110)",
      "institution": "Università Roma Tre - Via Ostiense 159, 00154, Roma, Italia"
    }
  },
  "skills": {
    "industry": {
      "category": "Conoscenze del settore",
      "items": [
        "Sviluppo Web, Mobile e Software",
        "Metodologie Agili",
        "SCRUM",
        "Object-Oriented Programming (OOP)",
        "Algorithms",
        "SQL",
        "Architetture Microfront-end",
        "TDD",
        "CI/CD"
      ]
    },
    "mobile": {
      "category": "Sviluppo Mobile"
    },
    "frontend": {
      "category": "Sviluppo Web - Front-End"
    },
    "backend": {
      "category": "Sviluppo Web - Back-End"
    },
    "database": {
      "category": "Database"
    },
    "languages": {
      "category": "Linguaggi di Programmazione"
    },
    "soft": {
      "category": "Soft Skills",
      "items": [
        "Problem Solving",
        "Critical Thinking",
        "Time Management",
        "Teamwork",
        "Self Learning",
        "Analytical reasoning",
        "Adaptability"
      ]
    },
    "tools": {
      "category": "Strumenti di sviluppo"
    }
  },
  "languages": {
    "italian": {
      "name": "Italiano",
      "level": "Madrelingua"
    },
    "english": {
      "name": "Inglese",
      "level": "Intermedio alto (B2 level)"
    }
  },
  "certifications": {
    "online": {
      "title": "Certificazioni di Corsi Online - Coursera, Udemy, LinkedIn Learning"
    },
    "b2": {
      "title": "B2 First - Cambridge University Press & Assessment English"
    },
    "speexx": {
      "title": "Spoken English CEFR Level B2.4 - Speexx"
    }
  },
  "footerNote": "Autorizzo il trattamento dei miei dati personali contenuti nel mio curriculum vitae in base all'art. 13 del D. Lgs. 196/2003 e all'art. 13 GDPR 679/16.",
  "labels": {
    "experience": "ESPERIENZE",
    "education": "FORMAZIONE",
    "skills": "SKILLS",
    "languages": "LINGUE",
    "certifications": "CERTIFICAZIONI"
  },
  "dates": {
    "present": "Oggi",
    "year": "anno",
    "years": "anni",
    "month": "mese",
    "months": "mesi"
  }
}
