{
  "header": {
    "title": "Ingegnere Informatico | Tech Lead | Senior Consultant",
    "subTitle": "Sviluppatore Front-End & Mobile",
    "location": "Roma, Italia"
  },
  "summary": "Sono un Ingegnere Informatico, sviluppatore Web & Mobile con 10 anni di esperienza. In possesso di Certificati Professionali. Tech Lead in progetti complessi. Ho progettato e sviluppato un'architettura innovativa a micro-frontend e ho gestito un team di oltre 10 sviluppatori. Sono un appassionato di tecnologia e nel mio tempo libero mi dedico ad imparare nuovi framework e librerie.",
  "experience": {
    "open_reply": {
      "location": "Via Cavour 59, 00184, Roma, Italia",
      "role": "Tech Lead | Senior Consultant | Esperto Front-end | Ingegnere Informatico",
      "description": "Ho lavorato con diversi clienti:",
      "projects": {
        "open_reply": {
          "description": "Ho lavorato come Tech Lead su diversi PoC per Open Reply, contribuendo alla progettazione e allo sviluppo di applicazioni cross-platform innovative. Queste applicazioni si distinguono perché l'intera interfaccia utente è controllata da agenti AI. Le principali tecnologie utilizzate sono: Python, OpenAI, OpenSearch, React Native, Expo."
        },
        "photosi": {
          "description": "Ho lavorato al progetto PhotoSì come esperto Frontend, contribuendo allo sviluppo dell'editor di fotolibri del cliente per applicazioni mobile e web. Le principali tecnologie utilizzate in questo progetto sono: React Native, Expo, Typescript, Javascript."
        },
        "churchs": {
          "description": "Ho lavorato al progetto Church's come esperto Frontend, contribuendo al miglioramento dell'esperienza utente del sito web di Church's. Le principali tecnologie utilizzate in questo progetto sono: Vue 3, Typescript, Javascript."
        },
        "mediaset": {
          "description": "Ho lavorato al progetto Mediaset come esperto Frontend, contribuendo allo sviluppo di una nuova applicazione Smart TV che consente agli utenti di guardare film, serie TV e canali live offerti da Mediaset. Le principali tecnologie utilizzate in questo progetto sono: React Native, Typescript, Javascript, Storybook."
        },
        "unipol": {
          "description": "Ho lavorato al progetto UnipolSai come Tech Lead ed esperto Frontend, guidando la progettazione e lo sviluppo di una nuova architettura micro-frontend basata su Module Federation. Ho diretto un team dinamico di oltre 10 sviluppatori. Gli strumenti principali di sviluppo utilizzati in questo progetto sono: React.js e Redux, Angular 14, Typescript, Javascript ES6, Node.js, Express, Webpack, Module Federation Plugin, Jest, React Testing Library, HTML 5, CSS 3, CSS in JS, SCSS/SASS, Git, Lerna/Nx."
        },
        "bat": {
          "description": "Ho lavorato al progetto Vuse.com come esperto Frontend, contribuendo allo sviluppo di un'applicazione web per la gestione e l'utilizzo della sigaretta elettronica MyVuse, oltre alla creazione di un browser interattivo basato su tecnologia BLE. Le principali tecnologie utilizzate in questo progetto includono: React.js e Redux, Typescript, Javascript ES6, Webpack, HTML 5, CSS 3, SCSS/SASS, Git."
        },
        "prada": {
          "description": "Ho lavorato sui progetti e-commerce di Prada, Miu Miu e Car Shoe come esperto Frontend. Gli strumenti principali di sviluppo utilizzati in questo progetto sono: Typescript, Javascript ES6, jQuery, Webpack, HTML 5, CSS 3, SCSS/SASS, Git."
        }
      }
    },
    "accenture": {
      "location": "Via Sciangai 53, 00144, Rome, Italy",
      "role": "Application Development Senior Analyst | Frontend Expert | Ingegnere Informatico",
      "description": "Ho lavorato con diversi clienti:",
      "projects": {
        "skoda": {
          "role": "Frontend Developer",
          "description": "Ho lavorato come Esperto Frontend nell'e-commerce di Škoda, contribuendo allo sviluppo di una piattaforma web all'avanguardia. Il mio ruolo prevedeva la creazione di un'interfaccia coinvolgente e intuitiva per migliorare l'esperienza utente complessiva. Gli strumenti principali di sviluppo utilizzati in questo progetto: ReactJs e Redux, Typescript, Javascript ES6, Webpack, Module Federation Plugin, HTML 5, CSS 3, Git, Lerna/Nx"
        },
        "leonardo": {
          "role": "Frontend Developer",
          "description": "Ho lavorato come Frontend developer nel progetto Euronaval, contribuendo allo sviluppo della piattaforma web. Il mio ruolo prevedeva la creazione di un'interfaccia coinvolgente e intuitiva per migliorare l'esperienza utente complessiva. Gli strumenti principali di sviluppo utilizzati in questo progetto: ReactJs e Redux, Typescript, Javascript ES6, Webpack, HTML 5, CSS 3, Git"
        },
        "egeos": {
          "description": "Ho lavorato come Esperto Frontend nel progetto e-GEO, contribuendo alla progettazione, costruzione e sviluppo di una piattaforma web all'avanguardia chiamata CLEOS. Gli strumenti principali di sviluppo utilizzati in questo progetto: ReactJs e Redux, Typescript, Javascript ES6, Webpack, HTML 5, CSS 3, Git"
        },
        "msc": {
          "description": "Ho lavorato come Frontend developer sul sito web di MSC Crociere, contribuendo allo sviluppo della piattaforma web. Gli strumenti principali di sviluppo utilizzati in questo progetto: ReactJs e Redux, Angular 10+, Typescript, Javascript ES6, Webpack, HTML 5, CSS 3, SCSS/SASS, Git"
        }
      }
    },
    "social_academy": {
      "location": "Via Catone 3, 00192, Roma, Italia",
      "role": "Sviluppatore Full-Stack | Architetto Software di Business in Cloud | Ingegnere Informatico",
      "description": "Ho progettato, sviluppato e testato i componenti software delle piattaforme di Social Academy: Marketplace (e-commerce di corsi di formazione), Skill Games (quiz online che ti permettono di scoprire la tua vocazione e potenziali competenze), MySA (una piattaforma a cui hai accesso alle lezioni e ai video dei tuoi corsi), Dashboard (una piattaforma di gestione che ti permette di gestire la tua accademia, i corsi, i lead e le campagne email) e BusinessInCloud (una piattaforma di marketing che ti permette di creare funnel e landing page). Ho utilizzato e/o integrato servizi esterni di Social Academy come Paypal, Stripe, Thrivecart, ClickFunnels, Mailchimp, Mailmunch, ActiveCampaign, Facebook, Calendly, Typeform e Zapier. In passato, ho utilizzato HTML 5, CSS 3, Ruby on Rails, ReactJs, AngularJs, Javascript, JQuery, AWS e Heroku per sviluppare e gestire tutte le piattaforme di Social Academy."
    },
    "nyu": {
      "company": "Università di New York",
      "location": "New York, NY, USA",
      "role": "Tirocinio",
      "logoText": "Università di New York",
      "description": "Ho lavorato al progetto Terraling, una collezione di database linguistici che permettono agli utenti di scoprire quali proprietà (morfologiche, sintattiche e semantiche) caratterizzano una lingua e quali differenze esistono tra le varie lingue."
    },
    "the_city": {
      "location": "Via In Arcione 98, 00187, Roma, Italia",
      "role": "Sviluppatore Full-Stack",
      "description": "Ho lavorato per un'agenzia immobiliare dove ho sviluppato il suo marketplace online utilizzando HTML 5, CSS 3, Javascript, JQuery, Bootstrap per il lato client. Il lato server è stato sviluppato con Ruby on Rails."
    },
    "innovaction_lab": {
      "location": "Via In Arcione 98, 00187, Roma, Italia",
      "role": "CTO | Sviluppatore Full-Stack",
      "description": "InnovAction Lab è un corso di formazione che ti da l’abilità di trasformare la tua idea innovativa in una startup. Io ed il mio team abbiamo creato “Fashape” per aiutare le persone a trovare i migliori prodotti maschili sul mercato attraverso una lista degli oggetti più richiesti dai social networks. Ho progettato e sviluppato l’intera piattaforma usando il framework MeteorJS e i servizi offerti da Microsoft Azure."
    },
    "hsc": {
      "location": "Via Elio Lampridio Cerva 103, 00143, Roma, Italia",
      "role": "Sviluppatore Software",
      "description": "Ho collaborato allo sviluppo del software aziendale dell'azienda, utilizzando il linguaggio di programmazione Delphi e PL/SQL per le query sul database."
    },
    "istc": {
      "location": "Via S. Martino della Battaglia 44, 00185, Roma, Italia",
      "role": "Tirocinio",
      "description": "Ho sviluppato un applicazione desktop per una piattaforma robotica con l’obiettivo di analizzare la postura di una persona attraverso tre semplici esercizi motori. L’applicazione è stata sviluppata in C# con l’ausilio del sensore Kinect per il tracciamento della postura"
    }
  },
  "education": {
    "state_exam": {
      "degree": "Superiore Tecnico di Stato e abilitazione alla professione di Ingegnere (107/110)",
      "institution": "Università Roma Tre - Via Ostiense 159, 00154, Roma, Italia"
    },
    "master": {
      "degree": "Laurea Magistrale in Ingegneria Informatica (105/110)",
      "institution": "Università Roma Tre - Via Ostiense 159, 00154, Roma, Italia"
    },
    "bachelor": {
      "degree": "Laurea Triennale in Ingegneria Informatica (94/110)",
      "institution": "Università Roma Tre - Via Ostiense 159, 00154, Roma, Italia"
    }
  },
  "skills": {
    "industry": {
      "category": "Conoscenze del settore",
      "items": [
        "Sviluppo Web, Mobile e Software",
        "Metodologie Agili",
        "SCRUM",
        "Object-Oriented Programming (OOP)",
        "Algorithms",
        "SQL",
        "Architetture Microfront-end",
        "TDD"
      ]
    },
    "mobile": {
      "category": "Sviluppo Mobile"
    },
    "frontend": {
      "category": "Sviluppo Web - Front-End"
    },
    "backend": {
      "category": "Sviluppo Web - Back-End"
    },
    "database": {
      "category": "Database"
    },
    "languages": {
      "category": "Linguaggi di Programmazione"
    },
    "soft": {
      "category": "Soft Skills",
      "items": [
        "Problem Solving",
        "Critical Thinking",
        "Time Management",
        "Teamwork",
        "Self Learning",
        "Analytical reasoning",
        "Adaptability"
      ]
    },
    "tools": {
      "category": "Strumenti di sviluppo"
    }
  },
  "languages": {
    "italian": {
      "name": "Italiano",
      "level": "Madrelingua"
    },
    "english": {
      "name": "Inglese",
      "level": "Intermedio alto (B2 level)"
    }
  },
  "certifications": {
    "online": {
      "title": "Certificazioni di Corsi Online - Coursera, Udemy, LinkedIn Learning"
    },
    "b2": {
      "title": "B2 First - Cambridge University Press & Assessment English"
    },
    "speexx": {
      "title": "Spoken English CEFR Level B2.4 - Speexx"
    }
  },
  "footerNote": "Autorizzo il trattamento dei miei dati personali contenuti nel mio curriculum vitae in base all'art. 13 del D. Lgs. 196/2003 e all'art. 13 GDPR 679/16.",
  "labels": {
    "experience": "ESPERIENZE",
    "education": "FORMAZIONE",
    "skills": "SKILLS",
    "languages": "LINGUE",
    "certifications": "CERTIFICAZIONI"
  },
  "dates": {
    "present": "Oggi",
    "year": "anno",
    "years": "anni",
    "month": "mese",
    "months": "mesi"
  }
}
