{
  "header": {
    "title": "Tech Lead | Ingegnere Informatico | Senior Consultant",
    "location": "Roma, Italia"
  },
  "summary": [
    "Ingegnere del Software con 10 anni di esperienza nello sviluppo Web e Mobile, specializzato nella progettazione di architetture scalabili. Certificato in React.js e Sviluppo Front-end da Meta, con un forte focus sulla realizzazione di applicazioni ad alte prestazioni e orientate all’utente.",
    "Ho ricoperto il ruolo di Tech Lead in progetti complessi, supervisionando team di sviluppo e guidando la progettazione di soluzioni innovative, tra cui un’architettura micro-frontend di nuova generazione per una piattaforma web e un’applicazione cross-platform con un agente AI che orchestra le interfacce utente.",
    "Utilizzo tecnologie avanzate di intelligenza artificiale (es. Google Antigravity, Claude, ChatGPT) per accelerare lo sviluppo, ottimizzare i processi e migliorare la qualità del software.",
    "Costantemente aggiornato su framework, librerie e metodologie moderne, mantenendo un forte focus sull'innovazione e il miglioramento continuo."
  ],
  "experience": {
    "open_reply": {
      "location": "Roma, Italia",
      "role": "Tech Lead | Senior Consultant | Esperto Front-end | Ingegnere Informatico",
      "description": "Ho lavorato con diversi clienti:",
      "projects": {
        "open_reply": {
          "description": "Ho ricoperto il ruolo di Tech Lead in diverse iniziative proof-of-concept presso Open Reply, guidando la progettazione e lo sviluppo di applicazioni cross-platform innovative con interfacce utente dinamiche orchestrate da agenti di intelligenza artificiale."
        },
        "photosi": {
          "description": "Ho contribuito alla progettazione e allo sviluppo di un editor di fotolibri ricco di funzionalità per mobile e web, supportando flussi di lavoro complessi di layout e personalizzazione."
        },
        "churchs": {
          "description": "Ho contribuito a migliorare l'esperienza utente del sito web di Church's implementando funzionalità mirate e ottimizzando l'usabilità, aumentando il coinvolgimento degli utenti e l'accessibilità."
        },
        "mediaset": {
          "description": "Ho contribuito allo sviluppo di una nuova applicazione Smart TV che consente agli utenti di accedere a film, serie TV e canali live offerti da Mediaset."
        },
        "unipol": {
          "description": "Ho progettato e realizzato una moderna piattaforma micro-frontend basata su Module Federation, fornendo leadership tecnica a un team interfunzionale di oltre 10 sviluppatori."
        },
        "bat": {
          "description": "Ho contribuito allo sviluppo di un'applicazione web per la gestione delle sigarette elettroniche MyVuse e creato un browser interattivo sfruttando la tecnologia BLE."
        },
        "prada": {
          "description": "Ho contribuito alla realizzazione e all'ottimizzazione di soluzioni e-commerce per i brand di lusso Prada, Miu Miu e Car Shoe, migliorando l'esperienza utente e le prestazioni della piattaforma."
        }
      }
    },
    "accenture": {
      "location": "Roma, Italia",
      "role": "Application Development Senior Analyst | Frontend Expert | Ingegnere Informatico",
      "description": "Ho lavorato con diversi clienti:",
      "projects": {
        "skoda": {
          "description": "Ho contribuito allo sviluppo e ottimizzazione della piattaforma e-commerce di Škoda integrando una soluzione a micro-frontend."
        },
        "leonardo": {
          "description": "Ho contribuito allo sviluppo e ottimizzazione del sito vetrina di Euronaval, progettando un'interfaccia coinvolgente e user-friendly per migliorare l'esperienza utente complessiva."
        },
        "egeos": {
          "description": "Ho contribuito allo sviluppo di un’interfaccia WebGIS per CLEOS, permettendo la visualizzazione e l’esplorazione di immagini satellitari e dati geospaziali con un design interattivo e intuitivo."
        },
        "msc": {
          "description": "Ho contribuito allo sviluppo e all'ottimizzazione del sito e-commerce di MSC, migliorando l'esperienza utente e le prestazioni della piattaforma."
        }
      }
    },
    "social_academy": {
      "location": "Roma, Italia",
      "role": "Sviluppatore Full-Stack | Architetto Software di Business in Cloud | Ingegnere Informatico",
      "description": "Ho contribuito alla progettazione, allo sviluppo e al testing dell'ecosistema multi-piattaforma di Social Academy (Marketplace, Skill Games, MySA, Dashboard, BusinessInCloud), integrando numerosi strumenti esterni (PayPal, Stripe, Mailchimp, Calendly, Typeform, Zapier) per offrire esperienze di e-learning e marketing fluide.",
      "techStack": [
        "HTML 5",
        "CSS 3",
        "Ruby on Rails",
        "ReactJs",
        "AngularJs",
        "JQuery",
        "AWS",
        "Heroku"
      ]
    },
    "nyu": {
      "location": "New York, USA",
      "role": "Sviluppatore Software | Tirocinio",
      "logoText": "Università di New York",
      "description": "Ho contribuito allo sviluppo di Terraling, una collezione di database linguistici consultabili che consente agli utenti di esplorare e confrontare le proprietà morfologiche, sintattiche e semantiche di più lingue.",
      "techStack": [
        "Ruby on Rails",
        "GraphQl",
        "ReactJs",
        "TypeScript",
        "Bootstrap"
      ]
    },
    "the_city": {
      "location": "Roma, Italia",
      "role": "Sviluppatore Full-Stack",
      "description": "Ho contribuito alla progettazione e allo sviluppo del marketplace online di un'agenzia immobiliare, offrendo un'esperienza fluida e user-friendly per clienti e agenti.",
      "techStack": [
        "HTML 5",
        "CSS 3",
        "Ruby on Rails",
        "ReactJs",
        "TypeScript",
        "Bootstrap"
      ]
    },
    "innovaction_lab": {
      "location": "Roma, Italia",
      "role": "CTO | Sviluppatore Full-Stack",
      "description": "Ho partecipato a InnovAction Lab, un programma acceleratore di startup, e co-creato Fashape, una piattaforma che aiuta gli utenti a scoprire i migliori prodotti di moda maschile attraverso una wishlist giornaliera curata dai trend dei social network.",
      "techStack": [
        "MeteorJS",
        "Microsoft Azure",
        "Javascript",
        "TypeScript",
        "Bootstrap"
      ]
    },
    "hsc": {
      "location": "Roma, Italia",
      "role": "Sviluppatore Software",
      "description": "Ho supportato lo sviluppo e la manutenzione del software aziendale di HSC, gestendo migrazioni di database e risolvendo problemi per migliorare l'efficienza operativa",
      "techStack": ["Delphi", "PL/SQL", "Oracle"]
    },
    "istc": {
      "location": "Roma, Italia",
      "role": "Sviluppatore Software | Tirocinio",
      "description": "Ho ingegnerizzato un'applicazione desktop per una piattaforma robotica per valutare e migliorare la postura e l'equilibrio degli utenti, sfruttando l'analisi automatizzata attraverso tre esercizi motori.",
      "techStack": ["C#", "Kinect"]
    }
  },
  "education": {
    "state_exam": {
      "degree": "Esame di Stato con abilitazione alla professione di Ingegnere dell'Informazione Specialista",
      "institution": "Università Roma Tre - Roma, Italia"
    },
    "master": {
      "degree": "Laurea Magistrale in Ingegneria Informatica",
      "institution": "Università Roma Tre - Roma, Italia"
    },
    "bachelor": {
      "degree": "Laurea Triennale in Ingegneria Informatica",
      "institution": "Università Roma Tre - Roma, Italia"
    }
  },
  "skills": {
    "industry": {
      "category": "Conoscenze del settore",
      "items": [
        "Sviluppo Web, Mobile e Software",
        "Metodologie Agili",
        "SCRUM",
        "Object-Oriented Programming (OOP)",
        "Algorithms",
        "SQL",
        "Architetture Microfront-end",
        "TDD",
        "CI/CD"
      ]
    },
    "mobile": {
      "category": "Sviluppo Mobile"
    },
    "frontend": {
      "category": "Sviluppo Web - Front-End"
    },
    "backend": {
      "category": "Sviluppo Web - Back-End"
    },
    "database": {
      "category": "Database"
    },
    "languages": {
      "category": "Linguaggi di Programmazione"
    },
    "soft": {
      "category": "Soft Skills",
      "items": [
        "Problem Solving",
        "Critical Thinking",
        "Time Management",
        "Teamwork",
        "Self Learning",
        "Analytical reasoning",
        "Adaptability"
      ]
    },
    "tools": {
      "category": "Strumenti di sviluppo"
    }
  },
  "languages": {
    "italian": {
      "name": "Italiano",
      "level": "Madrelingua"
    },
    "english": {
      "name": "Inglese",
      "level": "Intermedio alto (B2 level)"
    }
  },
  "footerNote": "Autorizzo il trattamento dei miei dati personali contenuti nel mio curriculum vitae in base all'art. 13 del D. Lgs. 196/2003 e all'art. 13 GDPR 679/16.",
  "labels": {
    "experience": "ESPERIENZE",
    "education": "FORMAZIONE",
    "skills": "SKILLS",
    "languages": "LINGUE",
    "certifications": "CERTIFICAZIONI"
  },
  "dates": {
    "present": "Oggi",
    "year": "anno",
    "years": "anni",
    "month": "mese",
    "months": "mesi"
  }
}
